{
  "tasks": [
    {
      "skill": "skills/tasks/maintain/checkDirectives.md",
      "subtasks": [
        "FixViolationAttachmentTimelineAndNotifications: Add missing timeline entry and follower notification test entries for AddAttachmentModal and attachment deletion in ClientDetailPage tests.md"
      ],
      "timestamp": "2026-02-26T09:26:44.467Z",
      "app": "SalesCRM"
    },
    {
      "skill": "skills/tasks/maintain/checkDirectives.md",
      "subtasks": [
        "FixViolationNativeSelectClientHeader: Replace native <select> elements in ClientHeader edit modal (Type and Status) with FilterSelect components"
      ],
      "timestamp": "2026-02-26T09:28:16.520Z",
      "app": "SalesCRM"
    },
    {
      "skill": "skills/tasks/maintain/checkDirectives.md",
      "subtasks": [
        "FixViolationTimelineUserLinks: Fix timeline user links to navigate to /users/:userId instead of '#' - requires adding createdByUserId to timeline data model and updating TimelineSectionClient component"
      ],
      "timestamp": "2026-02-26T09:28:22.072Z",
      "app": "SalesCRM"
    },
    {
      "skill": "skills/tasks/maintain/checkDirectives.md",
      "subtasks": [
        "FixViolationTasksListImportExportTestEntries: Add missing test entries in docs/tests.md for Import button, Export button, and ImportDialog format specification in TasksListHeader. The Import/Export buttons exist in code but have no test entries. The ImportDialog defines columns (Title, Description, Due Date, Priority, Client Name, Assignee) but no test entry verifies format docs are visible.",
        "RunTests: Verify tests pass after fix"
      ],
      "timestamp": "2026-02-26T09:59:23.157Z",
      "app": "SalesCRM"
    },
    {
      "skill": "skills/tasks/maintain/checkDirectives.md",
      "subtasks": [
        "FixViolationTasksListMarkCompleteTimeline: Add missing test entry in docs/tests.md for the Mark Complete action's timeline side effect. The backend (netlify/functions/tasks.ts:287-293) creates a 'Task Completed' timeline event on the associated client when Mark Complete is used, but the test entry only mentions removal from the list. The testSpec directive requires side effects to be tested.",
        "RunTests: Verify tests pass after fix"
      ],
      "timestamp": "2026-02-26T09:59:29.249Z",
      "app": "SalesCRM"
    },
    {
      "skill": "skills/tasks/maintain/checkDirectives.md",
      "subtasks": [
        "FixViolationTasksListAssigneeRole: Fix missing assignee role display in TaskCardList. Test entry says 'name with role (e.g., Sarah J. (PM))' but component only shows assigneeName. Need to: (1) add role column to users table in schema.ts, (2) update backend tasks.ts query to JOIN and return assignee role, (3) add assigneeRole to Task interface in tasksSlice.ts, (4) update TaskCardList.tsx to display role in parentheses. Also update docs/tests.md if needed.",
        "RunTests: Verify tests pass after fix"
      ],
      "timestamp": "2026-02-26T09:59:35.400Z",
      "app": "SalesCRM"
    },
    {
      "skill": "skills/tasks/maintain/checkDirectives.md",
      "subtasks": [
        "FixViolationTasksListFollowerNotifications: Fix missing follower notifications on task creation. Test entry says 'Task creation triggers follower notifications on the client' but backend tasks.ts POST handler only creates a timeline event - no follower notification is sent. Other functions (writeups.ts, deals.ts, task-notes.ts) implement the pattern: query client_followers JOIN notification_preferences, check task_created preference, create notification records. Add the same pattern to tasks.ts POST handler after the timeline event creation.",
        "RunTests: Verify tests pass after fix"
      ],
      "timestamp": "2026-02-26T09:59:41.105Z",
      "app": "SalesCRM"
    },
    {
      "skill": "skills/tasks/maintain/checkDirectives.md",
      "subtasks": [
        "FixViolationNavDuplicateLinks: Fix TopNavBar.tsx where all 4 nav link onClick handlers call navigate('/'), making them duplicate links to the same URL. The directive says 'Navigation sidebars and menus must not contain duplicate links pointing to the same URL.' The nav items have different href paths (/, /#suppliers, /#orders, /#inventory) but the onClick ignores these. Fix the onClick handlers to use hash-based scrolling so Suppliers scrolls to the suppliers section, Orders scrolls to orders section, etc. on the dashboard page.",
        "RunTests: Verify tests pass after fix"
      ],
      "timestamp": "2026-02-26T11:11:18.506Z",
      "app": "SupplierTracker"
    },
    {
      "skill": "skills/tasks/maintain/checkDirectives.md",
      "subtasks": [
        "FixViolationSupplierDetailsTabLinks: Add missing test entries for the three SupplierDetailsPage section-level tab links (Documents, Comments, Orders) that scroll to sections when clicked - these interactive elements lack dedicated test entries per testSpec.md directive to inventory every visible element",
        "RunTests: Verify tests pass after fix"
      ],
      "timestamp": "2026-02-26T11:29:31.758Z",
      "app": "SupplierTracker"
    },
    {
      "skill": "skills/tasks/maintain/checkDirectives.md",
      "subtasks": [
        "FixViolationSupplierDetailsModalTests: Add missing test entries for Edit Supplier modal Cancel and Validation, and Upload Document dialog Cancel - per testSpec.md directive to completely test modal dialogs. Other modals in the app (Add New Supplier, Create Purchase Order) have these entries but the SupplierDetailsPage modals do not",
        "RunTests: Verify tests pass after fix"
      ],
      "timestamp": "2026-02-26T11:29:37.828Z",
      "app": "SupplierTracker"
    }
  ]
}
